Emile666/stc1000_stm8/src/stc1000p.c
/*==================================================================
  File Name    : stc1000p.c
  Author       : Mats Staffansson / Emile
  ------------------------------------------------------------------
  Purpose : This files contains the main() function and all the 
            hardware related functions for the STM8 uC.
            It is meant for the STC1000 thermostat hardware WR-032.
            
            The original source is created by Mats Staffansson and
            adapted for the STM8S uC by Emile
  ------------------------------------------------------------------
  STC1000+ is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.
 
  STC1000+ is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.
 
  You should have received a copy of the GNU General Public License
  along with STC1000+.  If not, see <http://www.gnu.org/licenses/>.
  ==================================================================
*/ 
#include <intrinsics.h> 
#include "stc1000p.h"
#include "stc1000p_lib.h"
#include "scheduler.h"
#include "adc.h"
#include "eep.h"

// Global variables
bool      ad_err1 = false; // used for adc range checking
bool      ad_err2 = false; // used for adc range checking
uint8_t   probe2  = 0;     // cached flag indicating whether 2nd probe is active
bool      show_sa_alarm = false; // true = display alarm
bool      sound_alarm   = false; // true = sound alarm
bool      ad_ch   = false; // used in adc_task()
uint16_t  ad_ntc1 = (512L << FILTER_SHIFT);
uint16_t  ad_ntc2 = (512L << FILTER_SHIFT);
int16_t   temp_ntc1;         // The temperature in E-1 °C from NTC probe 1
int16_t   temp_ntc2;         // The temperature in E-1 °C from NTC probe 2
uint8_t   mpx_nr = 0;        // Used in multiplexer() function
// When in SWIM Debug Mode, PD1/SWIM needs to be disabled (= no IO)
uint8_t   portd_leds;        // Contains define PORTD_LEDS
uint8_t   portb, portc, portd, b;// Needed for save_display_state() and restore_display_state()
int16_t   pwr_on_tmr = 1000;     // Needed for 7-segment display test

// External variables, defined in other files
extern uint8_t led_e;                 // value of extra LEDs
extern uint8_t led_10, led_1, led_01; // values of 10s, 1s and 0.1s
extern bool    pwr_on;           // True = power ON, False = power OFF
extern uint8_t sensor2_selected; // DOWN button pressed < 3 sec. shows 2nd temperature / pid_output
extern bool    minutes;          // timing control: false = hours, true = minutes
extern bool    menu_is_idle;     // No menus in STD active
extern bool    fahrenheit;       // false = Celsius, true = Fahrenheit
extern uint16_t cooling_delay;   // Initial cooling delay
extern uint16_t heating_delay;   // Initial heating delay
extern int16_t  setpoint;        // local copy of SP variable
extern int16_t  kc;              // Parameter value for Kc value in %/°C
extern uint8_t  ts;              // Parameter value for sample time [sec.]
extern int16_t  pid_out;         // Output from PID controller in E-1 %

#if defined(OVBSC)
extern uint8_t  prg_state;
extern uint8_t  al_led_10, al_led_1, al_led_01;  // values of 10s, 1s and 0.1s
extern bool     ovbsc_pid_on;
extern bool     ovbsc_pump_on;
extern bool     ovbsc_run_prg;
extern uint16_t countdown;
#endif

/*-----------------------------------------------------------------------------
  Purpose  : This routine saves the current state of the 7-segment display.
             This is necessary since the buttons, but also the AD-channels,
             share the same GPIO bits.
             It uses the global variables portb, portc and portd.
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void save_display_state(void)
{
    // Save registers that interferes with LEDs and AD-channels
    portb   = PB_IDR & (CC_10 | CC_1); // Common-Cathode for 10s and 1s
    portc   = PC_IDR & BUTTONS;        // LEDs connected to buttons 
    // Common-Cathode for 0.1s and extras and AD-channels AIN4 and AIN3
    portd   = PD_IDR & (CC_01 | CC_e | AD_CHANNELS); 
    PB_ODR |= (CC_10 | CC_1);  // Disable common-cathode for 10s and 1s
    PD_ODR |= (CC_01 | CC_e);  // Disable common-cathode for 0.1s and extras
} // save_display_state()

/*-----------------------------------------------------------------------------
  Purpose  : This routine restores the current state of the 7-segment display.
             This is necessary since the buttons, but also the AD-channels,
             share the same GPIO bits.
             It uses the global variables portb, portc and portd.
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void restore_display_state(void)
{
    PD_ODR &= ~(CC_01 | CC_e | AD_CHANNELS); // init. CC_01, CC_e and AD-channels
    PD_ODR |= portd;                         // restore values for PORTD
    PC_ODR &= ~BUTTONS;                      // init. buttons
    PC_ODR |= portc;                         // restore values for PORTC
    PB_ODR &= ~(CC_10 | CC_1);               // init. CC_10 and CC_1
    PB_ODR |= portb;                         // restore values for PORTB
} // restore_display_state()

/*-----------------------------------------------------------------------------
  Purpose  : This routine multiplexes the 4 segments of the 7-segment displays.
             It runs at 1 kHz, so there's a full update after every 4 msec.
             There is a preprocessor directive important here:
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void multiplexer(void)
{
    uint8_t led_4 = LED_OFF;
    // The default 7-segment display up until 2020 was Common-Cathode
    // Make CC 1 and a single segment 0 to disable LED
    PC_ODR    &= ~PORTC_LEDS;    // Clear LEDs
    PD_ODR    &= ~portd_leds;    // Clear LEDs
    PB_ODR    |= (CC_10 | CC_1); // Disable common-cathode for 10s and 1s
    PD_ODR    |= (CC_01 | CC_e); // Disable common-cathode for 0.1s and extras

    switch (mpx_nr)
    {
        case 0: // output 10s digit
            PC_ODR |= (led_10 & PORTC_LEDS);        // Update PC7..PC3
            PD_ODR |= ((led_10 << 1) & portd_leds); // Update PD3..PD1
            PB_ODR &= ~CC_10;    // Enable  common-cathode for 10s
            if (sound_alarm) ALARM_ON;
            mpx_nr = 1;
            break;
        case 1: // output 1s digit
            PC_ODR |= (led_1 & PORTC_LEDS);        // Update PC7..PC3
            PD_ODR |= ((led_1 << 1) & portd_leds); // Update PD3..PD1
            PB_ODR &= ~CC_1;         // Enable  common-cathode for 1s
            ALARM_OFF;
            mpx_nr = 2;
            break;
        case 2: // output 01s digit
            PC_ODR |= (led_01 & PORTC_LEDS);        // Update PC7..PC3
            PD_ODR |= ((led_01 << 1) & portd_leds); // Update PD3..PD1
            PD_ODR &= ~CC_01;        // Enable common-cathode for 0.1s
            if (sound_alarm) ALARM_ON;
            mpx_nr = 3;
            break;
        case 3: // outputs special digits
#if defined(FOUR_DIGITS_DISPLAY)
            if (menu_is_idle)
            {
                if (led_e & LED_POINT)     led_4 = LED_P; // P = 2nd temp. probe
                else if (led_e & LED_HEAT) led_4 = LED_H; // H = Heating mode
                else if (led_e & LED_COOL) led_4 = LED_C; // C = Cooling mode
            }
            if (led_e & LED_SET)
                 led_4 |=  LED_DECIMAL; // dp=1: Profile mode
            else led_4 &= ~LED_DECIMAL; // dp=0: Thermostat mode
            PC_ODR |= (led_4 & PORTC_LEDS);        // Update PC7..PC3
            PD_ODR |= ((led_4 << 1) & portd_leds); // Update PD3..PD1
#else
            PC_ODR |= (led_e & PORTC_LEDS);        // Update PC7..PC3
            PD_ODR |= ((led_e << 1) & portd_leds); // Update PD3..PD1
#endif
            PD_ODR &= ~CC_e;     // Enable common-cathode for extras
            ALARM_OFF;
        default: // FALL-THROUGH (less code-size)
            mpx_nr = 0;
            break;
            //mpx_nr = 0;
            //break;
    } // switch            
} // multiplexer()

/*-----------------------------------------------------------------------------
  Purpose  : This is the interrupt routine for the Timer 2 Overflow handler.
             It runs at 1 kHz and drives the scheduler and the multiplexer.
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
#pragma vector = TIM2_OVR_UIF_vector
__interrupt void TIM2_UPD_OVF_IRQHandler(void)
{
    scheduler_isr();  // Run scheduler interrupt function
    if (!pwr_on)
    {   // Display OFF on dispay
	led_10     = LED_O;
	led_1      = led_01 = LED_F;
        led_e      = LED_OFF;
        pwr_on_tmr = 2000; // 2 seconds
    } // if
    else if (pwr_on_tmr > 0)
    {	// 7-segment display test for 2 seconds
        pwr_on_tmr--;
        led_10 = led_1 = led_01 = led_e = LED_ON;
    } // else if
    multiplexer();    // Run multiplexer for Display and Keys
    TIM2_SR1_UIF = 0; // Reset the interrupt otherwise it will fire again straight away.
} // TIM2_UPD_OVF_IRQHandler()

/*-----------------------------------------------------------------------------
  Purpose  : This routine initialises the system clock to run at 16 MHz.
             It uses the internal HSI oscillator.
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void initialise_system_clock(void)
{
    CLK_ICKR       = 0;           //  Reset the Internal Clock Register.
    CLK_ICKR_HSIEN = 1;           //  Enable the HSI.
    while (CLK_ICKR_HSIRDY == 0); //  Wait for the HSI to be ready for use.
    CLK_CKDIVR     = 0;           //  Ensure the clocks are running at full speed.
 
    // The datasheet lists that the max. ADC clock is equal to 6 MHz (4 MHz when on 3.3V).
    // Because fMASTER is now at 16 MHz, we need to set the ADC-prescaler to 4.
    ADC_CR1_SPSEL  = 0x02;        //  Set prescaler to 4, fADC = 4 MHz
    CLK_SWIMCCR    = 0;           //  Set SWIM to run at clock / 2.
    CLK_SWR        = 0xe1;        //  Use HSI as the clock source.
    CLK_SWCR       = 0;           //  Reset the clock switch control register.
    CLK_SWCR_SWEN  = 1;           //  Enable switching.
    while (CLK_SWCR_SWBSY != 0);  //  Pause while the clock switch is busy.
} // initialise_system_clock()

/*-----------------------------------------------------------------------------
  Purpose  : This routine initialises Timer 2 to generate a 1 kHz interrupt.
             16 MHz / (  16 *  1000) = 1000 Hz (1000 = 0x03E8)
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void setup_timer2(void)
{
    TIM2_PSCR    = 0x04;  //  Prescaler = 16
    TIM2_ARRH    = 0x03;  //  High byte of 1000
    TIM2_ARRL    = 0xE8;  //  Low  byte of 1000
    TIM2_IER_UIE = 1;     //  Enable the update interrupts
    TIM2_CR1_CEN = 1;     //  Finally enable the timer
} // setup_timer2()

/*-----------------------------------------------------------------------------
  Purpose  : This routine initialises all the GPIO pins of the STM8 uC.
             See stc1000p.h for a detailed description of all pin-functions.
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void setup_output_ports(void)
{
    PA_ODR      = 0x00; // Turn off all pins from Port A
    PA_DDR     |= (S3 | COOL | HEAT); // Set as output
    PA_CR1     |= (S3 | COOL | HEAT); // Set to Push-Pull
    PB_ODR      = (CC_10 | CC_1); // Turn off all pins from Port B (CC1 = CC2 = H)
    PB_DDR     |= (CC_10 | CC_1); // Set PB5..PB4 as output
    PB_CR1     |= (CC_10 | CC_1); // Set PB5..PB4 to Push-Pull
    PC_ODR      = 0x00; // Turn off all pins from Port C
    PC_DDR     |= PORTC_LEDS; // Set PC7..PC3 as outputs
    PC_CR1     |= PORTC_LEDS; // Set PC7..PC3 to Push-Pull
    PD_ODR      = (CC_01 | CC_e); // Turn off all pins from Port D (CC3 = CCe = H)
    PD_DDR     |= (0x40 | CC_01 | CC_e | portd_leds); // Set PD6..PD1 as outputs
    PD_CR1     |= (0x40 | CC_01 | CC_e | portd_leds); // Set PD6..PD1 to Push-Pull
} // setup_output_ports()

/*-----------------------------------------------------------------------------
  Purpose  : This task is called every 500 msec. and processes the NTC 
             temperature probes from NTC1 (PD3/AIN4) and NTC2 (PD2/AIN3)
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void adc_task(void)
{
  uint16_t temp;
  uint8_t  i;
  
