Emile666/stc1000_stm8/src/stc1000p.c
  // Save registers that interferes with LED's and disable common-cathodes
  __disable_interrupt();      // Disable interrups while reading buttons
  save_display_state();       // Save current state of 7-segment displays
  PD_DDR &= ~AD_CHANNELS;     // Set PD3 (AIN4) and PD2 (AIN3) to inputs
  PD_CR1 &= ~AD_CHANNELS;     // Set to floating-inputs (required by ADC)  
  for (i = 0; i < 200; i++) ; // Disable to let input signal settle
  if (ad_ch)
  {  // Process NTC probe 1
     temp       = read_adc(AD_NTC1);
     ad_ntc1    = ((ad_ntc1 - (ad_ntc1 >> FILTER_SHIFT)) + temp);
     temp_ntc1  = ad_to_temp(ad_ntc1,&ad_err1);
     temp_ntc1 += eeprom_read_config(EEADR_MENU_ITEM(tc));
  } // if
#if !(defined(OVBSC))
  else
  {  // Process NTC probe 2
     temp       = read_adc(AD_NTC2);
     ad_ntc2    = ((ad_ntc2 - (ad_ntc2 >> FILTER_SHIFT)) + temp);
     temp_ntc2  = ad_to_temp(ad_ntc2,&ad_err2);
     temp_ntc2 += eeprom_read_config(EEADR_MENU_ITEM(tc2));
  } // else
#endif
  ad_ch = !ad_ch;

  // Since the ADC disables GPIO pins automatically, these need
  // to be set to GPIO output pins again.
  PD_DDR  |= AD_CHANNELS;  // Set PD3 (AIN4) and PD2 (AIN3) as outputs again
  PD_CR1  |= AD_CHANNELS;  // Set PD3 (AIN4) and PD2 (AIN3) to Push-Pull again
  restore_display_state(); // Restore state of 7-segment displays
  __enable_interrupt();    // Re-enable Interrupts
} // adc_task()

/*-----------------------------------------------------------------------------
  Purpose  : This task is called every 100 msec. and creates a slow PWM signal
             from pid_output: T = 12.5 seconds. This signal can be used to
             drive a Solid-State Relay (SSR).
  Variables: pid_out (global) is used
  Returns  : -
  ---------------------------------------------------------------------------*/
void pid_to_time(void)
{
    static uint8_t std_ptt = 1; // state [on, off]
    static uint8_t ltmr    = 0; // #times to set S3 to 0
    static uint8_t htmr    = 0; // #times to set S3 to 1
    uint8_t x;                  // temp. variable
     
    x = (uint8_t)(pid_out >> 3); // divide by 8 to give 1.25 * pid_out
    
    switch (std_ptt)
    {
        case 0: // OFF
            if (ts == 0) std_ptt = 2;
            else if (ltmr == 0)
            {   // End of low-time
                htmr = x; // htmr = 1.25 * pid_out
                if ((htmr > 0) && pwr_on) std_ptt = 1;
            } // if
            else ltmr--; // decrease timer
            S3_OFF;      // S3 output = 0
            led_e &= ~(LED_HEAT | LED_COOL); // disable both LEDs
            break;
        case 1: // ON
            if (ts == 0) std_ptt = 2;
            else if (htmr == 0)
            {   // End of high-time
                ltmr = 125 - x; // ltmr = 1.25 * (100 - pid_out)
                if ((ltmr > 0) || !pwr_on) std_ptt = 0;
            } // if
            else htmr--; // decrease timer
            S3_ON;       // S3 output = 1
            if (kc > 0) led_e |= LED_HEAT; // Heating loop active
            else        led_e |= LED_COOL; // Cooling loop active
            break;
        case 2: // DISABLED
            S3_OFF; // S3 output = 0;
            if (ts > 0) std_ptt = 1;
            break;
    } // switch
} // pid_to_time()

/*-----------------------------------------------------------------------------
  Purpose  : This task is called every 100 msec. and reads the buttons, runs
             the STD and updates the 7-segment display.
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void std_task(void)
{
    read_buttons(); // reads the buttons keys, result is stored in _buttons
    menu_fsm();     // Finite State Machine menu
    pid_to_time();  // Make Slow-PWM signal and send to S3 output-port
} // std_task()

#if defined(OVBSC)
/*-----------------------------------------------------------------------------
  Purpose  : This task is called every second and contains the main control
             task for one vessel brew system controller (OVBSC)
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void ctrl_task(void)
{
    if (eeprom_read_config(EEADR_MENU_ITEM(CF))) // true = Fahrenheit
         fahrenheit = true;
    else fahrenheit = false;

    ovbsc_fsm(); // run OVBSC Finite State Machine
   // Start with updating the alarm
   if (ad_err1)
   {
       sound_alarm = true;
       RELAYS_OFF; // disable the output relays
       if (menu_is_idle)
       {  // Make it less anoying to nagivate menu during alarm
          led_10 = LED_A;
	  led_1  = LED_L;
          led_01 = LED_1;
	  led_e  = LED_OFF;
       } // if
   } 
   else 
   {
       ts = eeprom_read_config(EEADR_MENU_ITEM(Ts)); // Read Ts [seconds]
       pid_control(ovbsc_pid_on);  // Control PID controller
       if (ovbsc_pump_on) 
       {
           PUMP_ON; // Control pump
           led_e |= LED_COOL; // Pump LED on
       } // if
       else 
       {
           PUMP_OFF;
           led_e &= ~LED_COOL; // Cooling LED off
       } // else
       if (menu_is_idle)           // show counter/temperature if menu is idle
       {
           if (sound_alarm && show_sa_alarm)
           {
               led_10 = al_led_10;
	       led_1  = al_led_1;
	       led_01 = al_led_01;
           } else {
               if (ovbsc_run_prg && (prg_state == PRG_BOIL) || (prg_state == PRG_WAIT_STRIKE))
                    value_to_led(countdown,LEDS_INT);
               else value_to_led(temp_ntc1,LEDS_TEMP);
           } // else
           show_sa_alarm = !show_sa_alarm;
       } // if
   } // else
} // ctrl_task()
#else
/*-----------------------------------------------------------------------------
  Purpose  : This task is called every second and contains the main control
             task for the device. It also calls temperature_control().
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
void ctrl_task(void)
{
   int16_t sa, diff;
   
    if (eeprom_read_config(EEADR_MENU_ITEM(CF))) // true = Fahrenheit
         fahrenheit = true;
    else fahrenheit = false;
    if (eeprom_read_config(EEADR_MENU_ITEM(HrS))) // true = hours
         minutes = false; // control-timing is in hours 
    else minutes = true;  // control-timing is in minutes

   // Start with updating the alarm
   // cache whether the 2nd probe is enabled or not.
   probe2 = (uint8_t)eeprom_read_config(EEADR_MENU_ITEM(Pb2)); 
   if (ad_err1 || (ad_err2 && probe2))
   {
       sound_alarm = true;
       RELAYS_OFF; // disable the output relays
       if (menu_is_idle)
       {  // Make it less anoying to nagivate menu during alarm
          led_10 = LED_A;
	  led_1  = LED_L;
          if (ad_err1) led_01 = LED_1;
          else         led_01 = LED_2;
	  led_e = LED_OFF;
       } // if
       cooling_delay = heating_delay = 60;
   } else {
       sound_alarm = false; // reset the piezo buzzer
       if(((uint8_t)eeprom_read_config(EEADR_MENU_ITEM(rn))) < THERMOSTAT_MODE)
            led_e |=  LED_SET; // Indicate profile mode
       else led_e &= ~LED_SET;
 
       ts = eeprom_read_config(EEADR_MENU_ITEM(Ts)); // Read Ts [seconds]
       sa = eeprom_read_config(EEADR_MENU_ITEM(SA)); // Show Alarm parameter
       if (sa)
       {
           if (minutes) // is timing-control in minutes?
                diff = temp_ntc1 - setpoint;
	   else diff = temp_ntc1 - eeprom_read_config(EEADR_MENU_ITEM(SP));

	   if (diff < 0) diff = -diff;
	   if (sa < 0)
           {
  	      sa = -sa;
              sound_alarm = (diff <= sa); // enable buzzer if diff is small
	   } else {
              sound_alarm = (diff >= sa); // enable buzzer if diff is large
	   } // if
       } // if
       if (!minutes) setpoint = eeprom_read_config(EEADR_MENU_ITEM(SP));
       if (ts == 0)                // PID Ts parameter is 0?
       {
           temperature_control();  // Run thermostat
           pid_out = 0;            // Disable PID-output
       } // if
       else 
       {
           pid_control(true);      // Run PID controller
           RELAYS_OFF;             // Disable relays
       } // else
       if (menu_is_idle)           // show temperature if menu is idle
       {
           if (sound_alarm && show_sa_alarm)
           {
               led_10 = LED_A;
	       led_1  = LED_L;
	       led_01 = LED_d;
           } else {
               led_e &= ~LED_POINT; // LED in middle, does not seem to work
               switch (sensor2_selected)
               {
                   case 0: value_to_led(temp_ntc1,LEDS_TEMP); 
                           break;
                   case 1: value_to_led(temp_ntc2,LEDS_TEMP); 
                           led_e |= LED_POINT;
                           break;
                   case 2: value_to_led(pid_out  ,LEDS_PERC) ; 
                           break;
               } // switch
           } // else
           show_sa_alarm = !show_sa_alarm;
       } // if
   } // else
} // ctrl_task()

/*-----------------------------------------------------------------------------
  Purpose  : This task is called every minute or every hour and updates the
             current running temperature profile.
  Variables: minutes: timing control: false = hours, true = minutes
  Returns  : -
  ---------------------------------------------------------------------------*/
void prfl_task(void)
{
    static uint8_t min = 0;
    
    if (minutes)
    {   // call every minute
        update_profile();
        min = 0;
    } else {
        if (++min >= 60)
        {   // call every hour
            min = 0;
            update_profile(); 
        } // if
    } // else
} // prfl_task();
#endif

/*-----------------------------------------------------------------------------
  Purpose  : This is the main entry-point for the entire program.
             It initialises everything, starts the scheduler and dispatches
             all tasks.
  Variables: -
  Returns  : -
  ---------------------------------------------------------------------------*/
int main(void)
{
    if (RST_SR_SWIMF) // Check for SWIM Debug Reset
         portd_leds = PORTD_LEDS_SWIM;
    else portd_leds = PORTD_LEDS;
    __disable_interrupt();
    initialise_system_clock(); // Set system-clock to 16 MHz
    setup_output_ports();      // Init. needed output-ports for LED and keys
    setup_timer2();            // Set Timer 2 to 1 kHz
#if !(defined(OVBSC))
    pwr_on = eeprom_read_config(EEADR_POWER_ON); // check pwr_on flag
#endif    
    // Initialise all tasks for the scheduler
    add_task(adc_task ,"ADC",  0,  500); // every 500 msec.
    add_task(std_task ,"STD", 50,  100); // every 100 msec.
    add_task(ctrl_task,"CTL",200, 1000); // every second
#if !(defined(OVBSC))
    add_task(prfl_task,"PRF",300,60000); // every minute / hour
#endif    
    __enable_interrupt();

    while (1)
    {   // background-processes
        dispatch_tasks();       // Run task-scheduler()
        //__wait_for_interrupt(); // do nothing
    } // while
} // main()
